       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBPROGRAMA.
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT SUCURSALES ASSIGN TO DISK
                         ORGANIZATION IS INDEXED
                         ACCESS MODE IS SEQUENTIAL
                         RECORD KEY IS SUC-SUCURSAL
                         FILE STATUS IS SUC-ESTADO.
       DATA DIVISION.
       FILE SECTION.
       FD SUCURSALES LABEL RECORD IS STANDARD
                     VALUE OF FILE-ID IS "SucursalesI.dat".
        01 REG-SUCURSALES.
            02 SUC-SUCURSAL PIC X(3).
            02 SUC-RAZON PIC X(25).
            02 SUC-DIRE PIC X(20).
            02 SUC-TEL PIC X(20).
            02 SUC-CUIT PIC 9(11).
       WORKING-STORAGE SECTION.
        77 SUC-ESTADO PIC XX.
           88 OK-SUC VALUE '00'.
           88 NO-SUC VALUE '23'.
           88 EOF-SUC VALUE '10'.
        01 SUC-ANTERIOR.
            02 ANTERIOR-SUCURSAL PIC X(3).
            02 ANTERIOR-RAZON PIC X(25).
            02 ANTERIOR-DIRE PIC X(20).
            02 ANTERIOR-TEL PIC X(20).
            02 ANTERIOR-CUIT PIC 9(11).
       LINKAGE SECTION.
        01 TIM-CUIT PIC 9(11).
        01 REG-RELEASE-SUC-RAZON PIC X(25).
       PROCEDURE DIVISION USING TIM-CUIT,REG-RELEASE-SUC-RAZON.
       SUB.
        DISPLAY "INGRESE AL SUBPROGRAMA".
        OPEN INPUT SUCURSALES.
        DISPLAY "SUCURSAL A BUSCAR:"
        DISPLAY  TIM-CUIT.
        PERFORM 0100-LEER-SUCURSAL UNTIL SUC-CUIT EQUAL TIM-CUIT.
        MOVE SUC-RAZON TO REG-RELEASE-SUC-RAZON.
        CLOSE SUCURSALES.
        EXIT PROGRAM.
       0100-LEER-SUCURSAL.
        READ SUCURSALES RECORD.
